In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame([ [19,20,np.nan,15],[np.nan,np.nan,10,18],
    [17,12,11,np.nan],[20,18,19,13],[15,12,np.nan,np.nan]] , columns = ["ML","CA","DS","AP"])
df

     ML    CA    DS    AP
0  19.0  20.0   NaN  15.0
1   NaN   NaN  10.0  18.0
2  17.0  12.0  11.0   NaN
3  20.0  18.0  19.0  13.0
4  15.0  12.0   NaN   NaN

In [7]:
#for finding the number of na elments
df.isnull().sum()

ML    1
CA    1
DS    2
AP    2
dtype: int64

In [8]:
df.isna()

      ML     CA     DS     AP
0  False  False   True  False
1   True   True  False  False
2  False  False  False   True
3  False  False  False  False
4  False  False   True   True

# NAN Filling

by mean or Median

In [10]:
df.fillna(df.mean())

      ML    CA         DS         AP
0  19.00  20.0  13.333333  15.000000
1  17.75  15.5  10.000000  18.000000
2  17.00  12.0  11.000000  15.333333
3  20.00  18.0  19.000000  13.000000
4  15.00  12.0  13.333333  15.333333

In [13]:
df.fillna(df.sort_values("ML").median())

     ML    CA    DS    AP
0  19.0  20.0  11.0  15.0
1  18.0  15.0  10.0  18.0
2  17.0  12.0  11.0  15.0
3  20.0  18.0  19.0  13.0
4  15.0  12.0  11.0  15.0

In [15]:
secondDf = df.fillna(method = "ffill")
secondDf

     ML    CA    DS    AP
0  19.0  20.0   NaN  15.0
1  19.0  20.0  10.0  18.0
2  17.0  12.0  11.0  18.0
3  20.0  18.0  19.0  13.0
4  15.0  12.0  19.0  13.0

# Drop Nan

In [16]:
secondDf.dropna()

     ML    CA    DS    AP
1  19.0  20.0  10.0  18.0
2  17.0  12.0  11.0  18.0
3  20.0  18.0  19.0  13.0
4  15.0  12.0  19.0  13.0

In [17]:
secondDf['DS'].dropna()

1    10.0
2    11.0
3    19.0
4    19.0
Name: DS, dtype: float64

In [19]:
secondDf.dropna(axis = 1)

     ML    CA    AP
0  19.0  20.0  15.0
1  19.0  20.0  18.0
2  17.0  12.0  18.0
3  20.0  18.0  13.0
4  15.0  12.0  13.0

In [24]:
#drop rows with n nan valus wich n > thresh
df.dropna(thresh =3)

     ML    CA    DS    AP
0  19.0  20.0   NaN  15.0
2  17.0  12.0  11.0   NaN
3  20.0  18.0  19.0  13.0

In [28]:
#remove row wich is fulled with nan values
df.iloc[4,] = np.nan
df.dropna(how = 'all')

     ML    CA    DS    AP
0  19.0  20.0   NaN  15.0
1   NaN   NaN  10.0  18.0
2  17.0  12.0  11.0   NaN
3  20.0  18.0  19.0  13.0